{
  "architectures": [
    "Qwen3SiglipVLMForConditionalGeneration"
  ],
  "model_type": "qwen3_siglip_vlm",
  "image_token_id": -200,
  "pixel_shuffle_factor": 2,
  "tie_word_embeddings": false,
  "text_config": {
    "architectures": [
      "Qwen3ForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "head_dim": 8,
    "hidden_act": "silu",
    "hidden_size": 32,
    "initializer_range": 0.02,
    "intermediate_size": 64,
    "max_position_embeddings": 128,
    "max_window_layers": 1,
    "model_type": "qwen3",
    "num_attention_heads": 4,
    "num_hidden_layers": 1,
    "num_key_value_heads": 2,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 1000000,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 100
  },
  "vision_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 32,
    "image_size": 28,
    "intermediate_size": 64,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 4,
    "num_channels": 3,
    "num_hidden_layers": 1,
    "patch_size": 14
  }
}

