{
  "architectures": ["Qwen3MoeSiglipVLMForConditionalGeneration"],
  "model_type": "qwen3_moe_siglip_vlm",
  "image_token_id": -200,
  "pixel_shuffle_factor": 2,
  "tie_word_embeddings": false,
  "text_config": {
    "architectures": ["Qwen3MoeForCausalLM"],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "decoder_sparse_step": 1,
    "eos_token_id": 2,
    "head_dim": 8,
    "hidden_act": "silu",
    "hidden_size": 32,
    "initializer_range": 0.02,
    "intermediate_size": 64,
    "max_position_embeddings": 128,
    "max_window_layers": 2,
    "mlp_only_layers": [],
    "model_type": "qwen3_moe",
    "moe_intermediate_size": 16,
    "norm_topk_prob": true,
    "num_attention_heads": 4,
    "num_experts": 4,
    "num_experts_per_tok": 2,
    "num_hidden_layers": 2,
    "num_key_value_heads": 2,
    "output_router_logits": true,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 1000000.0,
    "router_aux_loss_coef": 0.001,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 128
  },
  "vision_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 32,
    "image_size": 28,
    "intermediate_size": 64,
    "layer_norm_eps": 1e-06,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 4,
    "num_channels": 3,
    "num_hidden_layers": 1,
    "patch_size": 14
  }
}
